# CannotPlaceFabricSheet Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..CannotPlaceFabricSheet Property
BuiltInFailures..::..FabricFailures Class See Also
---
Can't find a host for Fabric Sheet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPlaceFabricSheet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPlaceFabricSheet As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPlaceFabricSheet {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace